src/InformationRegisters/табАид_Настройки/табАид_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>табАид_Настройки</name>
  <resources>
    <name>ПочтаДляЕмайл</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>ПровайдерТелефония</name>
    <type>
      <types>EnumRef.табАид_ПровайдерыТелефонии</types>
    </type>
  </resources>
  <resources>
    <name>ЛогинТелефония</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольТелефония</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособАвторизацииТелефония</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровайдерSMS</name>
    <type>
      <types>EnumRef.ПровайдерыSMS</types>
    </type>
  </resources>
  <resources>
    <name>ЛогинДляОтправкиSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольДляОтправкиSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособАвторизацииSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяОтправителяSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВнешняяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаЗаполненияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалОбновленияСтатусов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаОбновленияСтатусов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияОбновленияСтатусов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключатьЗадолженность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереводВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТокенМужской</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенЖенский</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенЖенскийПеревод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенМужскойПеревод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючБС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/табАид_Настройки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ИспользоватьТиповыеНастройкиСМС.Видимость = ОтправкаSMS.НастройкаОтправкиSMSВыполнена();
	
	//можно отобрать параметры именно для конкретной орг-ции (на будущее)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Приоритет,
		|	табАид_Настройки.ПочтаДляЕмайл КАК ПочтаДляЕмайл,
		|	табАид_Настройки.ЛогинТелефония КАК ЛогинТелефония,
		|	табАид_Настройки.ПарольТелефония КАК ПарольТелефония,
		|	табАид_Настройки.СпособАвторизацииТелефония КАК СпособАвторизацииТелефония,
		|	табАид_Настройки.ЛогинДляОтправкиSMS КАК ЛогинДляОтправкиSMS,
		|	табАид_Настройки.ПарольДляОтправкиSMS КАК ПарольДляОтправкиSMS,
		|	табАид_Настройки.ПровайдерSMS КАК ПровайдерSMS,
		|	табАид_Настройки.ПровайдерТелефония КАК ПровайдерТелефония,
		|	табАид_Настройки.СпособАвторизацииSMS КАК СпособАвторизацииSMS,
		|	табАид_Настройки.ИмяОтправителяSMS КАК ИмяОтправителяSMS
		|ИЗ
		|	РегистрСведений.табАид_Настройки КАК табАид_Настройки
		|ГДЕ
		|	табАид_Настройки.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	2,
		|	табАид_Настройки.ПочтаДляЕмайл,
		|	табАид_Настройки.ЛогинТелефония,
		|	табАид_Настройки.ПарольТелефония,
		|	табАид_Настройки.СпособАвторизацииТелефония,
		|	табАид_Настройки.ЛогинДляОтправкиSMS,
		|	табАид_Настройки.ПарольДляОтправкиSMS,
		|	табАид_Настройки.ПровайдерSMS,
		|	табАид_Настройки.ПровайдерТелефония,
		|	табАид_Настройки.СпособАвторизацииSMS,
		|	табАид_Настройки.ИмяОтправителяSMS
		|ИЗ
		|	РегистрСведений.табАид_Настройки КАК табАид_Настройки
		|ГДЕ
		|	табАид_Настройки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Запись.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	//телефония
	НастройкиПровайдераТелефония = табАид_ОтправкаГолосовойПочты.НастройкиПровайдера(Запись.ПровайдерТелефония);
	ЗаполнитьСпособыАвторизацииТелефония();
	УстановитьПоляАвторизацииТелефония();
	
	Если Не Элементы.ПарольТелефония.РежимПароля = Неопределено и Элементы.ПарольТелефония.РежимПароля Тогда
		Запись.ПарольТелефония = ?(ЗначениеЗаполнено(Запись.ПарольТелефония), УникальныйИдентификатор, "");
	КонецЕсли;
	
	//СМС
	НастройкиПровайдераSMS = табАид_ОтправкаSMS.НастройкиПровайдера(Запись.ПровайдерSMS);
	ЗаполнитьСпособыАвторизации();
	УстановитьПоляАвторизации();
	
	Если Не Элементы.ПарольДляОтправкиSMS.РежимПароля = Неопределено и Элементы.ПарольДляОтправкиSMS.РежимПароля Тогда
		Запись.ПарольДляОтправкиSMS = ?(ЗначениеЗаполнено(Запись.ПарольДляОтправкиSMS), УникальныйИдентификатор, "");
	КонецЕсли;
	
	//Определяем список выбора для часовых поясов
	Элементы.ЧасовойПояс.СписокВыбора.Очистить();
	СписокЧП = СписокВыбораЧасовыхПоясов();
	Для каждого ЭлемЧП из СписокЧП Цикл
		Элементы.ЧасовойПояс.СписокВыбора.Добавить(ЭлемЧП.Значение, ЭлемЧП.Представление);
	КонецЦикла;
	
	Элементы.ВключатьЗадолженность.Видимость = НоваяАрхитектура();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВыбораЧасовыхПоясов()
	
	Возврат табАид_ОбщегоНазначенияПереопределяемый.ПолучитьСписокЧасовыхПоясов();
	
КонецФункции

&НаКлиенте
Процедура ШаблоныСообщений(Команда)
	
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗадания(Команда)
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаФормированияСобытий(Команда)
	
	ОткрытьФорму("РегистрСведений.табАид_ПравилаФормированияСобытий.Форма.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПодключенияТелефонии(Команда)
	
	ПараметрыОтправки = новый Структура("Организаци", Запись.Организация);
	ОткрытьФорму("ОбщаяФорма.табАид_ОтправкаГП", ПараметрыОтправки, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПодключенияСМС(Команда)
	
	ПараметрыОтправки = новый Структура("Организаци, ИмяОтправителя", Запись.Организация, Запись.ИмяОтправителяSMS);
	ОткрытьФорму("ОбщаяФорма.табАид_ОтправкаSMS", ПараметрыОтправки, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПодключенияПочты(Команда)
	Если Запись.ПочтаДляЕмайл.Пустая() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите учетную запись для электронной почты!",, "ПочтаДляЕмайл");
	иначе	
		ПараметрыФормы = Новый Структура("УчетнаяЗапись", Запись.ПочтаДляЕмайл);
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.ПроверкаНастроекУчетнойЗаписи", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТиповыеНастройкиСМС(Команда)
	
	ИспользоватьТиповыеНастройкиСМСНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьТиповыеНастройкиСМСНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОтправкиSMS = ОтправкаSMS.НастройкиОтправкиSMS();
	УстановитьПривилегированныйРежим(Ложь);
	
	НастройкиПровайдераSMS = ОтправкаSMS.НастройкиПровайдера(НастройкиОтправкиSMS.Провайдер);
	ЗаполнитьСпособыАвторизации();
	
	Если НастройкиОтправкиSMS.Свойство("СпособАвторизации")
		И ЗначениеЗаполнено(НастройкиОтправкиSMS.СпособАвторизации)
		И Элементы.СпособАвторизации.СписокВыбора.НайтиПоЗначению(НастройкиОтправкиSMS.СпособАвторизации) <> Неопределено Тогда
		
		Запись.СпособАвторизацииSMS = НастройкиОтправкиSMS.СпособАвторизации;
	КонецЕсли;
	
	УстановитьПоляАвторизации();
	
	Запись.ЛогинДляОтправкиSMS = НастройкиОтправкиSMS.Логин;
	Запись.ИмяОтправителяSMS = НастройкиОтправкиSMS.ИмяОтправителя;
	Запись.ПарольДляОтправкиSMS = НастройкиОтправкиSMS.Пароль;
	
	Если Элементы.Пароль.РежимПароля Тогда
		Запись.ПарольДляОтправкиSMS = ?(ЗначениеЗаполнено(НастройкиОтправкиSMS.Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьПоляАвторизации()
	
	//ПоляАвторизации = ЭтаФорма.НастройкиПровайдераSMS.СпособыАвторизации[Запись.СпособАвторизацииSMS];
	//
	//Для Каждого ИмяПоля Из СтрРазделить("Логин,Пароль", ",") Цикл
	//	мИмяПоля = ИмяПоля + "ДляОтправкиSMS";
	//	Поле = ПоляАвторизации.НайтиПоЗначению(ИмяПоля);
	//	Если Поле <> Неопределено Тогда
	//		ЭтаФорма.Элементы[мИмяПоля].Заголовок = Поле.Представление;
	//		ЭтаФорма.Элементы[мИмяПоля].Подсказка = Поле.Представление;
	//		ЭтаФорма.Элементы[мИмяПоля].Видимость = Истина;
	//	иначе
	//		ЭтаФорма.Элементы[мИмяПоля].Видимость = Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособыАвторизации()
	
	Элементы.СпособАвторизации.СписокВыбора.Очистить();
	
	СпособыАвторизацииПоУмолчанию = Новый СписокЗначений;
	СпособыАвторизацииПоУмолчанию.Добавить("ПоКлючу", НСтр("ru = 'По ключу (рекомендуется)'"));
	СпособыАвторизацииПоУмолчанию.Добавить("ПоЛогинуИПаролю", НСтр("ru = 'По логину и паролю'"));
	
	Для Каждого Элемент Из СпособыАвторизацииПоУмолчанию Цикл
		Если НастройкиПровайдераSMS.СпособыАвторизации.Свойство(Элемент.Значение) Тогда
			Элементы.СпособАвторизации.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Запись.СпособАвторизацииSMS = ЭтаФорма.Элементы.СпособАвторизации.СписокВыбора[0].Значение;
	ЭтаФорма.Элементы.СпособАвторизации.Видимость = ЭтаФорма.Элементы.СпособАвторизации.СписокВыбора.Количество() > 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровайдерSMSПриИзменении(Элемент)
	
	НастройкиПровайдераSMS = НастройкиПровайдера(Запись.ПровайдерSMS);
	
	ЗаполнитьСпособыАвторизации();
	УстановитьПоляАвторизации();
	
	Запись.ЛогинДляОтправкиSMS = "";
	Запись.ПарольДляОтправкиSMS = "";
	Запись.ИмяОтправителяSMS = "";
	
	УстановитьТекстИнструкцииПоПодключениюУслугиСМС();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАвторизацииПриИзменении(Элемент)
	
	Запись.ЛогинДляОтправкиSMS = "";
	Запись.ПарольДляОтправкиSMS = "";
	
	УстановитьПоляАвторизации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиПровайдера(Провайдер)
	
	Возврат табАид_ОтправкаSMS.НастройкиПровайдера(Провайдер);
	
КонецФункции

&НаКлиенте
Функция АдресОписанияУслугиВИнтернете()
	
	АдресВИнтернете = НастройкиПровайдераSMS.АдресОписанияУслугиВИнтернете;
	ОтправкаSMSКлиентПереопределяемый.ПриПолученииАдресаПровайдераВИнтернете(Запись.ПровайдерSMS, АдресВИнтернете);
	Возврат АдресВИнтернете;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстИнструкцииПоПодключениюУслугиСМС()
	
	ШаблонИнструкции = НСтр("ru = 'Для подключения услуги отправки SMS необходимо заключить договор с провайдером <a href = ""%1"">%2</a>.
	|Имя отправителя следует заполнять только в случае, если оно предусмотрено договором.
	|По вопросам оплаты услуги и проблемам авторизации следует обращаться к провайдеру услуги.'");
	
	Элементы.ИнструкцияПоПодключениюУслуги.Заголовок = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИнструкции, АдресОписанияУслугиВИнтернете(), Запись.ПровайдерSMS));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекстИнструкцииПоПодключениюУслугиСМС();
	УстановитьТекстИнструкцииПоПодключениюУслугиТелефонии();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиПровайдераТелефония(Провайдер)
	
	Возврат табАид_ОтправкаГолосовойПочты.НастройкиПровайдера(Провайдер);
	
КонецФункции

&НаКлиенте
Процедура ПровайдерТелефонииПриИзменении(Элемент)
	
	НастройкиПровайдераТелефония = НастройкиПровайдераТелефония(Запись.ПровайдерТелефония);
	
	ЗаполнитьСпособыАвторизацииТелефония();
	УстановитьПоляАвторизацииТелефония();
	
	Запись.ЛогинТелефония = "";
	Запись.ПарольТелефония = "";
	
	УстановитьТекстИнструкцииПоПодключениюУслугиТелефонии();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпособыАвторизацииТелефония()
	
	//Элементы.СпособАвторизацииТелефония.СписокВыбора.Очистить();
	//
	//СпособыАвторизацииПоУмолчанию = Новый СписокЗначений;
	//СпособыАвторизацииПоУмолчанию.Добавить("ПоКлючу", НСтр("ru = 'По ключу (рекомендуется)'"));
	//СпособыАвторизацииПоУмолчанию.Добавить("ПоЛогинуИПаролю", НСтр("ru = 'По логину и паролю'"));
	//
	//Для Каждого Элемент Из СпособыАвторизацииПоУмолчанию Цикл
	//	Если НастройкиПровайдераТелефония.СпособыАвторизации.Свойство(Элемент.Значение) Тогда
	//		Элементы.СпособАвторизацииТелефония.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Запись.СпособАвторизацииТелефония = Элементы.СпособАвторизацииТелефония.СписокВыбора[0].Значение;
	//Элементы.СпособАвторизацииТелефония.Видимость = Элементы.СпособАвторизацииТелефония.СписокВыбора.Количество() > 1;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоляАвторизацииТелефония()
	
	//ПоляАвторизации = НастройкиПровайдераТелефония.СпособыАвторизации[Запись.СпособАвторизацииТелефония];
	//
	//Для Каждого ИмяПоля Из СтрРазделить("Логин,Пароль", ",") Цикл
	//	мИмяПоля = ИмяПоля + "Телефония";
	//	Поле = ПоляАвторизации.НайтиПоЗначению(ИмяПоля);
	//	Если Поле <> Неопределено Тогда
	//		Элементы[мИмяПоля].Заголовок = Поле.Представление;
	//		Элементы[мИмяПоля].Подсказка = Поле.Представление;
	//		Элементы[мИмяПоля].Видимость = Истина;
	//	иначе
	//		Элементы[мИмяПоля].Видимость = Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстИнструкцииПоПодключениюУслугиТелефонии()
	
	ШаблонИнструкции = НСтр("ru = 'Для подключения услуги отправки голосовых сообщений необходимо заключить договор с провайдером <a href = ""%1"">%2</a>.
	|Имя отправителя следует заполнять только в случае, если оно предусмотрено договором.
	|По вопросам оплаты услуги и проблемам авторизации следует обращаться к провайдеру услуги.'");
	
	Элементы.ИнструкцияПоПодключениюУслугиТелефония.Заголовок = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИнструкции, АдресОписанияУслугиВИнтернете(), Запись.ПровайдерТелефония));
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАвторизацииТелефонияПриИзменении(Элемент)
	
	Запись.ЛогинТелефония = "";
	Запись.ПарольТелефония = "";
	
	УстановитьПоляАвторизацииТелефония();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьСтатусыСообщенийПриИзменении(Элемент)
	Элементы.ИнтервалОбновления.Доступность = Запись.ОбновлятьСтатусыСообщений;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если  табАид_ОбщегоНазначенияПереопределяемый.НастройкаРегЗаданийВыполнена() Тогда
		табАид_ОбщегоНазначенияПереопределяемый.СоздатьРегламентноеЗаданиеЗаполненияЗадолженности(Истина);
		табАид_ОбщегоНазначенияПереопределяемый.СоздатьРегламентноеЗаданиеОбновленияСтатусов(Истина);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если Запись.ПровайдерТелефония = ПредопределенноеЗначение("Перечисление.удз_ПровайдерыТелефонии.Женский") Тогда
	//	Если Запись.ПереводВызова Тогда
	//		Запись.ПарольТелефония = Запись.ТокенЖенскийПеревод;
	//	иначе
	//		Запись.ПарольТелефония = Запись.ТокенЖенский;
	//	КонецЕсли;
	//иначе
	//	Если Запись.ПереводВызова Тогда
	//		Запись.ПарольТелефония = Запись.ТокенМужскойПеревод;
	//	иначе
	//		Запись.ПарольТелефония = Запись.ТокенМужской;  
	//	КонецЕсли;			
	//КонецЕсли;
	Запись.ПарольТелефония = "dGI6a2dlS3ZVUlN2bDBKcFFkKw==";
	//Запись.ПарольТелефония = "Ga5bHri3Dwtf";	
	Запись.СпособАвторизацииТелефония = "ПоКлючу";
	//Запись.СпособАвторизацииТелефония = "ПоЛогинуИПаролю";
	
	// Проверяем на корректность заполненные данные.
	Если Запись.ВремяОкончанияОбновленияСтатусов <= Запись.ВремяНачалаОбновленияСтатусов Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректно заполнено время обновления статусов.");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоваяАрхитектура()
	Возврат ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
КонецФункции
